Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption
Specifies how Rigid Links will be made for the Analytical Model.
Remarks:
Rigid Links are curves connecting neighboring Structural Beams and Structural Columns.

Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.FromColumn
For a structural beam, this indicates that the structural column setting should be used to determine rigid link formation.
This value is not applicable to structural columns.

Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.Disabled
For a structural column, this disables rigid Link formation, unless the neighboring structural beam overrides the setting.
For a structural beam, this disables rigid Link formation, overriding the neighboring structural column's setting.

Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.Enabled
For a structural column, enables rigid link formation, unless the neighboring structural beam overrides the setting.
For a structural beam, enables rigid link formation, overriding the neighboring structural column's setting.